//=====================================================================================================================
// Проект: Модуль репозитория
// Раздел: Подсистема файловых ресурсов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositoryFileErrors.cs
*		Работа с ошибками подсистемы файловых ресурсов.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup RepositoryResourceFile
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения ошибок подсистемы файловых ресурсов
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XResourceFileErrors
		{
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Файл не найден
            /// </summary>
            public static readonly Result NotFound = new()
            {
                Code = 1001,
                Message = "Файл не найден",
                Succeeded = false,
            };

			/// <summary>
			/// Нельзя удалить константный файл
			/// </summary>
			public static readonly Result NotDeleteConst = new()
            {
                Code = 1002,
                Message = "Нельзя удалить константный файл",
                Succeeded = false,
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================