//=====================================================================================================================
// Проект: Модуль репозитория
// Раздел: Подсистема файловых ресурсов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositoryFileCommon.cs
*		Определение общих типов и структур данных для подсистемы файловых ресурсов.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup RepositoryResourceFile Подсистема файловых ресурсов
         * \ingroup Repository
         * \brief Подсистема файловых ресурсов предназначения для работы с отдельной сущностью – файла - независимо 
			от места и способа его хранения.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Место хранение файла
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TResourceFileStorage
		{
			/// <summary>
			/// Файл храниться локально
			/// </summary>
			/// <remarks>
			/// В данном случае просто сохраняется информация об его идентификаторе
			/// </remarks>
			Local,

			/// <summary>
			/// Файл храниться на сервере
			/// </summary>
			Server,

			/// <summary>
			/// Файл храниться в базе данных
			/// </summary>
			Database,
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Формат хранения файла в базе данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TResourceFileSaveFormat
		{
			/// <summary>
			/// Данные файла в формате строки base64
			/// </summary>
			Base64,

			/// <summary>
			/// Данные файла в формате байтового массива
			/// </summary>
			Raw
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================
