//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема сериализации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusSerializationReference.cs
*		Вспомогательный класс хранящий данные для связывания поля/свойства типа ссылочного объекта.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Reflection;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreSerialization
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Вспомогательный класс хранящий данные для связывания поля/свойства типа ссылочного объекта
		/// </summary>
		/// <remarks>
		/// При чтении ссылки на объект мы пытаемся найти объект по его сохраненным параметрам, однако может быть такая
		/// ситуация что этот объект еще не создан, и тогда мы должны повторить это процесс после загрузки всех объектов
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public class CSerializeReference
		{
			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Код типа объекта ссылки
			/// </summary>
			public Int32 CodeObject;

			/// <summary>
			/// Метаданные поля/свойства
			/// </summary>
			public MemberInfo Member;

			/// <summary>
			/// Индекс элемента для коллекций
			/// </summary>
			public Int32 Index;

			/// <summary>
			/// Экземпляр объекта которому принадлежит поле/свойство
			/// </summary>
			public System.Object Instance;

			/// <summary>
			/// Идентификатор объекта ссылки
			/// </summary>
			public Int32 ID;

			/// <summary>
			/// Имя типа объекта ссылки
			/// </summary>
			public String TypeObject;

			/// <summary>
			/// Найденный объект
			/// </summary>
			public System.Object Result;
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================