//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема атрибутов
// Подраздел: Атрибуты дополнительного описания поля/свойства объекта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusAttributePropertyOrder.cs
*		Атрибут для определения порядка отображения свойств/полей в инспекторе свойств.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Runtime.CompilerServices;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup CoreAttribute
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Атрибут для определения порядка отображения свойств/полей в инспекторе свойств
        /// </summary>
        /// <remarks>
        /// Атрибут является эмуляцией одноименного атрибута компонента WPF Toolkit
        /// </remarks>
        //-------------------------------------------------------------------------------------------------------------
        [AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public sealed class LotusPropertyOrderAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal readonly Int32 _order;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Порядок отображения свойства
			/// </summary>
			public Int32 Order
			{
				get { return _order; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="order">Порядок отображения свойства</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusPropertyOrderAttribute(Int32 order)
			{
				_order = order;
			}
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для автоматического порядка отображения свойств/полей в инспекторе свойств согласно их декларации
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public sealed class LotusAutoOrderAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal readonly Int32 _order;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Порядок отображения свойства
			/// </summary>
			public Int32 Order
			{
				get { return _order; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="order">Порядок отображения свойства</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusAutoOrderAttribute([CallerLineNumber] Int32 order = 0)
			{
				_order = order;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================