//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема поддержки инспектора свойств
// Подраздел: Атрибуты для инспектора свойств
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusInspectorConditionEnabled.cs
*		Атрибут доступности для редактирования(поля/свойства)в зависимости от логического условия равенства.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup CoreInspectorAttribute Атрибуты для инспектора свойств
         * \ingroup CoreInspector
         * \brief Атрибуты для инспектора свойств управляют отдельным аспектами отображения свойства и расширяют его управления.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут доступности для редактирования(поля/свойства)в зависимости от логического условия равенства
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
#if UNITY_2017_1_OR_NEWER
		public sealed class LotusEnabledEqualityAttribute : UnityEngine.PropertyAttribute
#else
		public sealed class LotusEnabledEqualityAttribute : Attribute
#endif
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal String mManagingMemberName;
			internal TInspectorMemberType mMemberType;
			internal Boolean mValue;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Имя члена объекта от которого зависит доступность свойства для редактирования
			/// </summary>
			public String ManagingMemberName
			{
				get { return mManagingMemberName; }
				set { mManagingMemberName = value; }
			}

			/// <summary>
			/// Тип члена объекта
			/// </summary>
			public TInspectorMemberType MemberType
			{
				get { return mMemberType; }
				set { mMemberType = value; }
			}

			/// <summary>
			/// Целевое значение поля/свойства при котором доступно редактирование
			/// </summary>
			public Boolean Value
			{
				get { return mValue; }
				set { mValue = value; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="managing_member_name">Имя члена объекта от которого зависит доступность свойства для редактирования</param>
			/// <param name="member_type">Тип члена объекта</param>
			/// <param name="value">Целевое значение поля/свойства при котором доступно редактирование</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusEnabledEqualityAttribute(String managing_member_name, TInspectorMemberType member_type, Boolean value)
			{
				mManagingMemberName = managing_member_name;
				mMemberType = member_type;
				mValue = value;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================