//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема ViewModel для файловой системы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCollectionViewModelFileSystem.cs
*		CollectionViewMode для элементов файловой системы.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreFileSystem
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Коллекция для отображения элементов файловой системы
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CollectionViewModelFileSystem : CollectionViewModelHierarchy<ILotusViewModelHierarchy,
			ILotusFileSystemEntity>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CollectionViewModelFileSystem()
				: base(String.Empty)
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя коллекции</param>
			//---------------------------------------------------------------------------------------------------------
			public CollectionViewModelFileSystem(String name)
				: base(name)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя коллекции</param>
			/// <param name="source">Источник данных</param>
			//---------------------------------------------------------------------------------------------------------
			public CollectionViewModelFileSystem(String name, ILotusFileSystemEntity source)
				: base(name, source)
			{
			}
			#endregion

			#region ======================================= МЕТОДЫ ILotusCollectionViewModelHierarchy =================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Создание конкретной ViewModel для указанной модели
			/// </summary>
			/// <param name="model">Модель</param>
			/// <param name="parent">Родительский элемент ViewModel</param>
			/// <returns>ViewModel</returns>
			//---------------------------------------------------------------------------------------------------------
			public override ILotusViewModelHierarchy CreateViewModelHierarchy(System.Object model, ILotusViewModelHierarchy parent)
			{
				if(model is CFileSystemFile file)
				{
					return new ViewModelFileSystemFile(file, parent);
				}

				if (model is CFileSystemDirectory directory)
				{
					return new ViewModelDirectorySystemFile(directory, parent);
				}

				return null;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================