//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема ViewModel для файловой системы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusViewModelFileSystemFile.cs
*		ViewModel для файла файловой системы.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreFileSystem
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс реализующий ViewModel для файла файловой системы
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class ViewModelFileSystemFile : ViewModelHierarchy<ILotusFileSystemEntity>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="model">Модель</param>
			/// <param name="parentItem">Родительский узел</param>
			//---------------------------------------------------------------------------------------------------------
			public ViewModelFileSystemFile(ILotusFileSystemEntity model, ILotusViewModelHierarchy parentItem)
				: base(model, parentItem)
			{
				SetContextMenu();
				IsNotify = true;
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка контекстного меню
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public virtual void SetContextMenu()
			{
				_contextMenuUI = new CUIContextMenu();
				_contextMenuUI.ViewModel = this;
				_contextMenuUI.AddItem(CUIContextMenu.Remove.Duplicate());
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================