//=====================================================================================================================
// Проект: Модуль единиц измерения
// Раздел: Общие данные
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUnitMeasurementUnits.cs
*		Определение общих классов и структур данных для работы с единицами измерений.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace UnitMeasurement
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup UnitMeasurement
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширений для типов единиц измерения
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XUnitType
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение соответствующего типа измерения от указанного единицы измерения
			/// </summary>
			/// <param name="unit_type">Единица измерения</param>
			/// <returns>Тип измерения</returns>
			//---------------------------------------------------------------------------------------------------------
			public static TMeasurementType GetMeasurementType(Enum unit_type)
			{
				Type type = unit_type.GetType();
				TMeasurementType measurement_type = TMeasurementType.Undefined;
				switch (type.Name)
				{
					case nameof(TUnitThing):
						{
							measurement_type = TMeasurementType.Thing;
						}
						break;
					case nameof(TUnitLength):
						{
							measurement_type = TMeasurementType.Length;
						}
						break;
					case nameof(TUnitArea):
						{
							measurement_type = TMeasurementType.Area;
						}
						break;
					default:
						break;
				}

				return (measurement_type);
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================