//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема сериализации
// Подраздел: Атрибуты подсистема сериализации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusSerializationAttributeAliasType.cs
*		Атрибут для определения псевдонима имени типа.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreSerialization
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для определения псевдонима имени типа
		/// </summary>
		/// <remarks>
		/// По умолчанию сериализуется собственное имя типа, данным атрибутов это можно поменять например для более
		/// удобочитаемого имени типа.
		/// Также следует позаботится об уникальности псевдонима в рамках проекта.
		/// Так как псевдоним образует имя элемента в формате XML то он должен подчинятся правилам использования 
		/// допустимых символов
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Struct | AttributeTargets.Class, AllowMultiple = false)]
		public sealed class LotusSerializeAliasTypeAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal String mName;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Имя типа для сериализации
			/// </summary>
			public String Name
			{
				get { return mName; }
				set { mName = value; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя типа для сериализации</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusSerializeAliasTypeAttribute(String name)
			{
				mName = name;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================