//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема сериализации
// Подраздел: Атрибуты подсистема сериализации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusSerializationAttributeAsPrimitive.cs
*		Атрибут для информирование о том что тип сериализуется как примитивный.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreSerialization
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для информирование о том что тип сериализуется как примитивный
		/// </summary>
		/// <remarks>
		/// В контексте текстового потока данных это означает что он может быт записан в одну строку (в формат атрибута XML)
		/// Тип помеченный данным атрибутом должен обязательно реализовать статический метод 
		/// с именем <see cref="LotusSerializeAsPrimitiveAttribute.DESERIALIZEFROMSTRING"/> и обычный метод с именем
		/// <see cref="LotusSerializeAsPrimitiveAttribute.SERIALIZETOSTRING"/>
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Class | AttributeTargets.Struct, AllowMultiple = false, Inherited = false)]
		public sealed class LotusSerializeAsPrimitiveAttribute : Attribute
		{
			#region ======================================= КОНСТАНТНЫЕ ДАННЫЕ ========================================
			/// <summary>
			/// Имя статического метода типа который создает объект из переданной строки
			/// </summary>
			public const String DESERIALIZEFROMSTRING = "DeserializeFromString";

			/// <summary>
			/// Имя метода типа который сериализует объект в строку и возвращает её
			/// </summary>
			public const String SERIALIZETOSTRING = "SerializeToString";
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================