//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема файловой системы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusFileSystemView.cs
*		Специализация элементов отображения для работы с объектам файловой системы.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreFileSystem
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс реализующий элемент отображения для элемента файловой системы
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CViewItemHierarchyFileSystem : ViewItemHierarchy<ILotusFileSystemEntity>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemHierarchyFileSystem()
				: this(String.Empty)
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя модели</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemHierarchyFileSystem(String name)
				: base(name)
			{
				SetContextMenu();
				mIsNotify = true;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="dataContext">Данные</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemHierarchyFileSystem(ILotusFileSystemEntity dataContext)
				: base(dataContext)
			{
				SetContextMenu();
				mIsNotify = true;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="dataContext">Данные</param>
			/// <param name="parentItem">Родительский узел</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemHierarchyFileSystem(ILotusFileSystemEntity dataContext, ILotusViewItemHierarchy parentItem)
				: base(dataContext, parentItem)
			{
				SetContextMenu();
				mIsNotify = true;
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка контекстного меню
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public virtual void SetContextMenu()
			{
				mUIContextMenu = new CUIContextMenu();
				mUIContextMenu.ViewItem = this;
				mUIContextMenu.AddItem(CUIContextMenu.Remove.Duplicate());
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Построение дочерней иерархии согласно источнику данных
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public override void BuildFromDataContext()
			{
				Clear();
				CCollectionViewHierarchyFileSystem.BuildFromParent(this, mOwner);
			}
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Коллекция для отображения элементов файловой системы
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CCollectionViewHierarchyFileSystem : CollectionViewHierarchy<CViewItemHierarchyFileSystem, 
			ILotusFileSystemEntity>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CCollectionViewHierarchyFileSystem()
				: base(String.Empty)
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя коллекции</param>
			//---------------------------------------------------------------------------------------------------------
			public CCollectionViewHierarchyFileSystem(String name)
				: base(name)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя коллекции</param>
			/// <param name="source">Источник данных</param>
			//---------------------------------------------------------------------------------------------------------
			public CCollectionViewHierarchyFileSystem(String name, ILotusFileSystemEntity source)
				: base(name, source)
			{
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================