//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема файловой системы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusFileSystemEntity.cs
*		Общие типы и структуры данных файловой подсистемы.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup CoreFileSystem Подсистема файловой системы
         * \ingroup Core
         * \brief Подсистема файловой системы реализует концепцию элементов файловой системы как иерархическую модель данных.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс представляющий собой базовую сущность элемента файловой системы
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusFileSystemEntity : ILotusNameable, ILotusViewItemBuilder, 
			ILotusCheckOne<ILotusFileSystemEntity>, ILotusSupportEditInspector
		{
			/// <summary>
			/// Полное имя(полный путь) элемента файловой системы
			/// </summary>
			String FullName { get; }

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Удаление элемента файловой системы
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void Delete();
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================