//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема поддержки инспектора свойств
// Подраздел: Атрибуты для инспектора свойств
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusInspectorCollectionReorderable.cs
*		Атрибут для расширенного отображения и управления элементами стандартных коллекций и коллекциями Lotus.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreInspectorAttribute
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для расширенного отображения и управления элементами стандартных коллекций и коллекциями Lotus
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public sealed class LotusReorderableAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal String _titleFieldName;

			// Методы изменения коллекции
			internal String _itemsChangedMethodName;
			internal String _contextMenuMethodName;

			// Методы переупорядочивания коллекции
			internal String _sortAscendingMethodName;
			internal String _sortDescendingMethodName;
			internal String _reorderItemChangedMethodName;

			// Методы для рисования элементов коллекции
			internal String _drawItemMethodName;
			internal String _heightItemMethodName;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Имя поля дочернего свойства выступающее в качестве заголовка для сложных свойств
			/// </summary>
			public String TitleFieldName
			{
				get { return _titleFieldName; }
				set { _titleFieldName = value; }
			}

			//
			// МЕТОДЫ ИЗМЕНЕНИЯ КОЛЛЕКЦИИ
			//
			/// <summary>
			/// Имя метода вызываемого после изменения количества элементов списка (Добавления / удаления элементов)
			/// </summary>
			/// <remarks>
			/// Метод не должен принимать аргументов.
			/// Пустое значение означает что метод не используется
			/// </remarks>
			public String ItemsChangedMethodName
			{
				get { return _itemsChangedMethodName; }
				set { _itemsChangedMethodName = value; }
			}

			/// <summary>
			/// Имя метода вызываемого для формирования контекстного меню
			/// </summary>
			/// <remarks>
			/// Метод должен возвращать список элементов соответствующего типа.
			/// Пустое значение означает что метод не используется
			/// </remarks>
			public String ContextMenuMethodName
			{
				get { return _contextMenuMethodName; }
				set { _contextMenuMethodName = value; }
			}

			//
			// МЕТОДЫ ПЕРЕУПОРЯДОЧИВАНИЯ КОЛЛЕКЦИИ
			//
			/// <summary>
			/// Имя метода для сортировки элементов коллекции по возрастанию
			/// </summary>
			/// <remarks>
			/// Метод не должен принимать аргументов.
			/// Пустое значение означает что сортировка не используется
			/// </remarks>
			public String SortAscendingMethodName
			{
				get { return _sortAscendingMethodName; }
				set { _sortAscendingMethodName = value; }
			}

			/// <summary>
			/// Имя метода для сортировки элементов коллекции по убыванию
			/// </summary>
			/// <remarks>
			/// Метод не должен принимать аргументов.
			/// Пустое значение означает что сортировка не используется
			/// </remarks>
			public String SortDescendingMethodName
			{
				get { return _sortDescendingMethodName; }
				set { _sortDescendingMethodName = value; }
			}

			/// <summary>
			/// Имя метода вызываемого после изменения порядка элементов (Перемещение элемента, сортировка)
			/// </summary>
			/// <remarks>
			/// Метод должен принимать два аргумента:
			/// 1. Целый тип - индекс предыдущей позиции
			/// 2. Целый тип - индекс новой позиции
			/// Пустое значение означает что метод не используется
			/// </remarks>
			public String ReorderItemChangedMethodName
			{
				get { return _reorderItemChangedMethodName; }
				set { _reorderItemChangedMethodName = value; }
			}

			//
			// МЕТОДЫ ДЛЯ РИСОВАНИЯ ЭЛЕМЕНТОВ КОЛЛЕКЦИИ
			//
			/// <summary>
			/// Имя метода для рисование элемента коллекции
			/// </summary>
			/// <remarks>
			/// Метод должен принимать два аргумента:
			/// 1. Тип прямоугольник - область отображения элемента
			/// 2. Целый тип - индекс текущего элемента
			/// </remarks>
			public String DrawItemMethodName
			{
				get { return _drawItemMethodName; }
				set { _drawItemMethodName = value; }
			}

			/// <summary>
			/// Имя метода для вычисление высоты элемента
			/// </summary>
			/// <remarks>
			/// Метод должен принимать один аргумент целого типа обозначающий индекс элемента и возвращать высоту элемента
			/// Пустое значение обозначение что будет принята высота одного контрола
			/// </remarks>
			public String HeightItemMethodName
			{
				get { return _heightItemMethodName; }
				set { _heightItemMethodName = value; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public LotusReorderableAttribute()
			{
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================