//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема поддержки инспектора свойств
// Подраздел: Атрибуты для инспектора свойств
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusInspectorConditionVisible.cs
*		Атрибут видимости(отображения поля/свойства)в зависимости от логического условия равенства.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreInspectorAttribute
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут видимости(отображения поля/свойства)в зависимости от логического условия равенства
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
#if UNITY_2017_1_OR_NEWER
		public sealed class LotusVisibleEqualityAttribute : UnityEngine.PropertyAttribute
#else
		public sealed class LotusVisibleEqualityAttribute : Attribute
#endif
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal String _managingMemberName;
			internal TInspectorMemberType _memberType;
			internal Boolean _value;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Имя члена объекта от которого определяется видимость
			/// </summary>
			public String ManagingMemberName
			{
				get { return _managingMemberName; }
				set { _managingMemberName = value; }
			}

			/// <summary>
			/// Тип члена объекта
			/// </summary>
			public TInspectorMemberType MemberType
			{
				get { return _memberType; }
				set { _memberType = value; }
			}

			/// <summary>
			/// Целевое значение поля/свойства при котором существует видимость
			/// </summary>
			public Boolean Value
			{
				get { return _value; }
				set { _value = value; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="managingMemberName">Имя члена объекта от которого определяется видимость</param>
			/// <param name="memberType">Тип члена объекта</param>
			/// <param name="value">Целевое значение поля/свойства при котором существует видимость</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusVisibleEqualityAttribute(String managingMemberName, TInspectorMemberType memberType, Boolean value)
			{
				_managingMemberName = managingMemberName;
				_memberType = memberType;
				_value = value;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================