//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Вспомогательная подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusBooleanHelper.cs
*		Работа с логическим типом платформы NET.
*		Реализация дополнительных методов работы с логическим типом платформы NET.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreHelpers
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий дополнительные методы для работы с типом <see cref="Boolean"/>
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XBoolean
		{
			/// <summary>
			/// Текстовые значение логического типа которые означает истинное значение
			/// </summary>
			public static readonly String[] TrueValues = new String[]
			{
				"True",
				"true",
				"1",
				"on",
				"On",
				"истина",
				"Истина",
				"да",
				"Да"
			};

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Преобразование текста в логическое значение
			/// </summary>
			/// <param name="text">Текст</param>
			/// <returns>Значение</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Boolean Parse(String text)
			{
				return Array.IndexOf(TrueValues, text) > -1;
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================