//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Вспомогательная подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusSynchContextHelper.cs
*		Статический класс реализующий дополнительные методы контекстом синхронизации.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Threading;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreHelpers
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий дополнительные методы контекстом синхронизации
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XSynchContextHelper
		{
			/// <summary>
			/// Запуск действия в том же контексте
			/// </summary>
			/// <param name="context">Контекстом синхронизации</param>
			/// <param name="actionToRun">Действие</param>
			public static void RunWithinContext(this SynchronizationContext context, Action actionToRun)
			{
				if (context == SynchronizationContext.Current || context == null)
				{
					actionToRun?.Invoke();
				}
				else
				{
					context.Send(_ => actionToRun?.Invoke(), null);
				}
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================
