//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема поддержки инспектора свойств
// Подраздел: Атрибуты для инспектора свойств
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusInspectorValidation.cs
*		Атрибуты подтверждения правильности (валидации) данных.
*		Реализация вспомогательных атрибутов которые определят валидность данных(соответствие их определённым требованиям).
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreInspectorAttribute
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут подтверждения правильности (валидации) данных
		/// </summary>
		/// <remarks>
		/// Для Unity, в случае не прохождения валидации данных, отображается бокс с информацией
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
#if UNITY_2017_1_OR_NEWER
		public sealed class LotusValidationAttribute : UnityEngine.PropertyAttribute
#else
		public sealed class LotusValidationAttribute : Attribute
#endif
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal String mValidationMethodName;
			internal String mMessage = "Data has not been validated";
			internal TLogType mMessageType;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Имя метода который осуществляет проверку на валидацию данных
			/// </summary>
			/// <remarks>
			/// Метод должен иметь один аргумент соответствующего типа и возвращать true, если данные проходят 
			/// валидацию и false в противном случае 
			/// </remarks>
			public String ValidationMethodName
			{
				get { return mValidationMethodName; }
				set { mValidationMethodName = value; }
			}

			/// <summary>
			/// Сообщение которое отображается если данные не прошли валидацию
			/// </summary>
			public String Message
			{
				get { return mMessage; }
				set { mMessage = value; }
			}

			/// <summary>
			/// Тип сообщения
			/// </summary>
			public TLogType MessageType
			{
				get { return mMessageType; }
				set { mMessageType = value; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="validation_method">Имя метода который осуществляет проверку на валидацию данных</param>
			/// <param name="message_type">Тип сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusValidationAttribute(String validation_method, TLogType message_type = TLogType.Error)
			{
				mValidationMethodName = validation_method;
				mMessageType = message_type;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="validation_method">Имя метода который осуществляет проверку на валидацию данных</param>
			/// <param name="message">Сообщение которое отображается если данные не прошли валидацию</param>
			/// <param name="message_type">Тип сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusValidationAttribute(String validation_method, String message, TLogType message_type = TLogType.Error)
			{
				mValidationMethodName = validation_method;
				mMessage = message;
				mMessageType = message_type;
			}
			#endregion

		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================