//=====================================================================================================================
// Проект: Модуль репозитория
// Раздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositorySoftDeletableEntity.cs
*		Определение базовой сущности репозитория с поддержкой мягкого удаления.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup RepositoryBase
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение базовой сущности репозитория с поддержкой мягкого удаления
		/// </summary>
		/// <typeparam name="TKey">Тип ключа идентификатора</typeparam>
		//-------------------------------------------------------------------------------------------------------------
		public abstract class SoftDeletableEntityBase<TKey> : RepositoryEntityBase<TKey>, ILotusRepositorySoftDeletable 
			where TKey : struct, IEquatable<TKey>
		{
			/// <summary>
			/// Дата удаления сущности
			/// </summary>
			public DateTime? Deleted { get; set; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение базовой сущности репозитория с поддержкой мягкого удаления
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public abstract class CSoftDeletableEntityBase : SoftDeletableEntityBase<Guid>
		{
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================