//=====================================================================================================================
// Проект: Модуль репозитория
// Раздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositoryRequest.cs
*		Определение интерфейса и моделей для запроса данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup RepositoryBase
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Базовый интерфейс запроса данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusRequest
		{
			/// <summary>
			/// Информация о странице
			/// </summary>
			ILotusPageInfoRequest? PageInfo { get; set; }

			/// <summary>
			/// Параметры сортировки данных
			/// </summary>
			ILotusSortProperty[]? Sorting { get; set; }

			/// <summary>
			/// Параметры фильтрации данных
			/// </summary>
			ILotusFilterProperty[]? Filtering { get; set; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Базовый класс для запроса данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class Request
		{
			/// <summary>
			/// Информация о странице
			/// </summary>
			public CPageInfoRequest PageInfo { get; set; } 

			/// <summary>
			/// Параметры сортировки данных
			/// </summary>
			public CSortProperty[]? Sorting { get; set; }

			/// <summary>
			/// Параметры фильтрации данных
			/// </summary>
			public CFilterProperty[]? Filtering { get; set; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================