//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема хранения состояний
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusMementoState.cs
*		Интерфейс для представления состояния с возможностью отмены/повторения действия.
*		Определение концепции интерфейса для возможности не нарушая инкапсуляцию, зафиксировать и сохранить внутреннее
*	состояние объекта так, чтобы позднее восстановить его в это состояние с возможностью отмены/повторения действия.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup CoreMemento Подсистема хранения состояний
         * \ingroup Core
         * \brief Подсистема хранения состояний обеспечивает сохранения состояния объекта/системы и возможность его последующего
			восстановления. Является основой для шаблона проектирования повторении и отмены действия. 
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для представления состояния с возможностью отмены/повторения действия
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusMementoState
		{
			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отмена последнего действия
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void Undo();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Повторение последнего действия
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void Redo();
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================