//=====================================================================================================================
// Проект: LotusPlatform
// Проект: Модуль репозитория
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDomainContextFactory.cs
*		Фабрика для создания контекста базы данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using Microsoft.EntityFrameworkCore.Design;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Repository;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Фабрика для создания контекста базы данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class DomainContextFactory : IDesignTimeDbContextFactory<DomainContext>
		{
			public DomainContext CreateDbContext(String[] args) => DomainContext.Create(XConnection.ConnectionString);
		}
	}
}
//=====================================================================================================================
