//=====================================================================================================================
// Проект: LotusPlatform
// Проект: Модуль репозитория
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusConnection.cs
*		Класс для формирования подключения к тестовой базе данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Reflection;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Repository;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для формирования подключения к тестовой базе данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XConnection
		{
			/// <summary>
			/// Строка для подключения к тестовой базе данных
			/// </summary>
			public const String ConnectionString = "Host=localhost;Database=test_date;Username=postgres;Password=1234";
		}
	}
}
//=====================================================================================================================
