//=====================================================================================================================
// Проект: LotusPlatform
// Проект: Модуль репозитория
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDomainDataStorage.cs
*		Контекст базы данных для тестирования.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Reflection;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Repository;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Контекст базы данных для тестирования
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class DomainDataStorage : DataStorageContextDb<DomainContext>
		{
			public DomainDataStorage(DomainContext context) 
				: base(context)
			{
			}
		}
	}
}
//=====================================================================================================================
