//=====================================================================================================================
// Проект: Модуль математической системы
// Раздел: Подсистема 2D геометрии
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGeometry2DMatrix2x2.cs
*		Двухмерная матрица размерностью 2х2.
*		Реализация двухмерной матрицы размерностью 2х2 для реализации базовых трансформаций в 2D плоскости.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Runtime.InteropServices;
//=====================================================================================================================
namespace Lotus
{
	namespace Maths
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup MathGeometry2D
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Двухмерная матрица размерностью 2х2
		/// </summary>
		/// <remarks>
		/// Реализация двухмерной матрицы размерностью 2х2 для реализации базовых трансформаций в 2D плоскости
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[Serializable]
		[StructLayout(LayoutKind.Sequential)]
		public struct Matrix2Dx2
		{
			#region ======================================= СТАТИЧЕСКИЕ МЕТОДЫ  =======================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Вычисление определителя двухмерной матрицы. Расположение компонентов:
			/// | a1, a2 |
			/// | b1, b2 |
			/// </summary>
			/// <param name="a1">Компонент a1</param>
			/// <param name="a2">Компонент a2</param>
			/// <param name="b1">Компонент b1</param>
			/// <param name="b2">Компонент b2</param>
			/// <returns>Определитель двухмерной матрицы</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Double Determinat(Double a1, Double a2, Double b1, Double b2)
			{
				return (a1 * b2) - (b1 * a2);
			}
			#endregion

			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Компонент с позицией 11
			/// </summary>
			public Double M11;

			/// <summary>
			/// Компонент с позицией 12
			/// </summary>
			public Double M12;

			/// <summary>
			/// Компонент с позицией 21
			/// </summary>
			public Double M21;

			/// <summary>
			/// Компонент с позицией 22
			/// </summary>
			public Double M22;
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Двухмерная матрица размерностью 2х2
		/// </summary>
		/// <remarks>
		/// Реализация двухмерной матрицы размерностью 2х2 для реализации базовых трансформаций в 2D плоскости
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[Serializable]
		[StructLayout(LayoutKind.Sequential, Pack =4)]
		public struct Matrix2Dx2f
		{
			#region ======================================= СТАТИЧЕСКИЕ МЕТОДЫ ========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Вычисление определителя двухмерной матрицы. Расположение компонентов:
			/// | a1, a2 |
			/// | b1, b2 |
			/// </summary>
			/// <param name="a1">Компонент a1</param>
			/// <param name="a2">Компонент a2</param>
			/// <param name="b1">Компонент b1</param>
			/// <param name="b2">Компонент b2</param>
			/// <returns>Определитель двухмерной матрицы</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Single Determinat(Single a1, Single a2, Single b1, Single b2)
			{
				return (a1 * b2) - (b1 * a2);
			}
			#endregion

			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Компонент с позицией 11
			/// </summary>
			public Single M11;

			/// <summary>
			/// Компонент с позицией 12
			/// </summary>
			public Single M12;

			/// <summary>
			/// Компонент с позицией 21
			/// </summary>
			public Single M21;

			/// <summary>
			/// Компонент с позицией 22
			/// </summary>
			public Single M22;
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================