
using System.Runtime.CompilerServices;

[assembly: InternalsVisibleToAttribute("Lotus.Core.Test")]

namespace Lotus.Core
{
    /**
     * \defgroup Core Модуль базового ядра
     * \brief Модуль, содержащий код, развивающий в целом платформу NET и реализующий дополнительную базовую функциональность
        на уровне среды NET. Большинство реализаций модуля кроссплатформенно. Является основой для построения других 
        подсистем и модулей.
     * \details Модуль это прежде всего кроссплатформенный набор инструментов для решения повседневных задач: большая библиотека
        расширений, реализации коллекций на основе массива, гибкая и универсальная подсистема задач, подсистема сообщений
        и многое другое.
     */
}