//=====================================================================================================================
// Проект: Модуль базового ядра
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCoreModule.cs
*		Определение модуля базового ядра.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup Core Модуль базового ядра
         * \brief Модуль, содержащий код, развивающий в целом платформу NET и реализующий дополнительную базовую функциональность
			на уровне среды NET. Большинство реализаций модуля кроссплатформенно. Является основой для построения других 
			подсистем и модулей.
		 * \details Модуль это прежде всего кроссплатформенный набор инструментов для решения повседневных задач: большая библиотека
			расширений, реализации коллекций на основе массива, гибкая и универсальная подсистема задач, подсистема сообщений
			и многое другое.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================