//=====================================================================================================================
// Проект: Модуль репозитория
// Раздел: Подсистема сортировки
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositorySortingProperty.cs
*		Определение основных типов для сортировки по свойству/полю объекта.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup RepositorySorting Подсистема сортировки
         * \ingroup Repository
         * \brief Подсистема сортировки определяет однотипный унифицированный набор типов для сортировки данных.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения сортировки по одному свойству/полю объекта
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusSortProperty
		{
			/// <summary>
			/// Свойство/поле по которому идет сортировка 
			/// </summary>
			String PropertyName { get; set; }

			/// <summary>
			/// Статус сортировки по убыванию
			/// </summary>
			/// <remarks>
			/// По умолчанию, сортировка всегда идет по возрастанию
			/// </remarks>
			Boolean? IsDesc { get; set; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения сортировки по одному свойству/полю объекта
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CSortProperty : ILotusSortProperty 
		{
			/// <summary>
			/// Свойство/поле по которому идет сортировка 
			/// </summary>
			public String PropertyName { get; set; } = default!;

			/// <summary>
			/// Статус сортировки по убыванию
			/// </summary>
			/// <remarks>
			/// По умолчанию, сортировка всегда идет по возрастанию
			/// </remarks>
			public Boolean? IsDesc { get; set; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================