//=====================================================================================================================
// Проект: Модуль математической системы
// Раздел: Подсистема генерации псевдослучайных значений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusMathRandomGuarantee.cs
*		Генератор получения гарантированных вероятностных значений в указанном интервале.
*		Реализация генератора который обеспечивает точное в процентной отношении получения гарантированных вероятностных
*	значений в указанном интервале.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Collections.Generic;
//=====================================================================================================================
namespace Lotus
{
	namespace Maths
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup MathRandom
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Генератор получения гарантированных вероятностных значений в указанном интервале
		/// </summary>
		/// <remarks>
		/// Реализация генератора который обеспечивает точное в процентной отношении получения гарантированных
		/// вероятностных значений в указанном интервале.
		/// <para>
		/// Разберем более подробно использование объектов данного типа
		/// </para>
		/// <para>
		/// Например, нам нужно получить объект с вероятностью 25% на 100 вызовов. В этом случае надо использовать
		/// AddProbability(1, 25). Теперь если вызвать NextProbability() - 100 раз, гарантировано 
		/// будут возвращено 25 раз значение 1, т.е. значение индекса
		/// </para>
		/// <para>
		/// Например, нам нужно получить 1-ю вещь с вероятностью 25%, 2-ю вещь с вероятностью 50% и 3-ю вещь с вероятностью 25%
		/// В этом случае надо использовать AddProbabilityList(25, 50, 25), здесь индексы присваиваются автоматически начиная с нулю
		/// Обратите внимания в сумме проценты дают 100% - это значит каждый раз будет выпадать какая-либо вещь, 
		/// т.е. будет возвращаться индекс 0 (что соответствует 1 вещи) или 1 или 2
		/// </para>
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public class CRandomGuarantee
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal Int32 _capacity;
			internal Int32[] _data;
			internal List<Int32> _probability;
			internal Int32 _currentIndex;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Емкость генератора
			/// </summary>
			public Int32 Capacity
			{
				get { return _capacity; }
			}

			/// <summary>
			/// Список вероятностей в процентах
			/// </summary>
			public List<Int32> Probability
			{
				get { return _probability; }
			}

			/// <summary>
			/// Текущий индекс данных
			/// </summary>
			public Int32 CurrentIndex
			{
				get { return _currentIndex; }
			}

			/// <summary>
			/// Текущее значение данных
			/// </summary>
			public Int32 CurrentValue
			{
				get
				{
					if (_currentIndex == -1)
					{
						return _currentIndex;
					}
					else
					{
						return _data[_currentIndex];
					}
				}
			}

			/// <summary>
			/// Данные
			/// </summary>
			public Int32[] Data
			{
				get { return _data; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует базовую емкость генератора
			/// </summary>
			/// <param name="capacity">Емкость генератора</param>
			//---------------------------------------------------------------------------------------------------------
			public CRandomGuarantee(Int32 capacity = 100)
			{
				_capacity = capacity;
				_data = new Int32[_capacity];
				_probability = new List<Int32>();
				_currentIndex = -1;
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Перезапуск данных
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public void Reset()
			{
				for (var i = 0; i < _probability.Count; i++)
				{
					_data[i] = _probability[i];
				}

				for (var ir = _probability.Count; ir < _capacity; ir++)
				{
					_data[ir] = -1;
				}

				var rnd = new Random();
				var n = _data.Length;
				while (n > 1)
				{
					n--;
					var k = rnd.Next(n + 1);

					var old = _data[n];
					_data[n] = _data[k];
					_data[k] = old;
				}

				_currentIndex = -1;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Переопределение емкости генератора
			/// </summary>
			/// <remarks>
			/// Автоматически очищается список вероятностей, его надо создавать по-новому
			/// </remarks>
			/// <param name="capacity">Емкость генератора</param>
			//---------------------------------------------------------------------------------------------------------
			public void ResetCapacity(Int32 capacity)
			{
				_capacity = capacity;
				_data = new Int32[_capacity];
				_probability.Clear();
				_currentIndex = -1;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Добавление вероятности значения
			/// </summary>
			/// <remarks>
			/// Индекс значения и есть статус выпадения этого значения. Должен быть больше нуля
			/// </remarks>
			/// <param name="index">Индекс вероятности</param>
			/// <param name="probability">Вероятность значения в процентах</param>
			//---------------------------------------------------------------------------------------------------------
			public void AddProbability(Int32 index, Int32 probability)
			{
				var count = probability * _capacity / 100;
				for (var i = 0; i < count; i++)
				{
					_probability.Add(index);
				}

				Reset();
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Добавление вероятности значения списком
			/// </summary>
			/// <remarks>
			/// Здесь индексы присваиваются автоматически начиная с нулю
			/// </remarks>
			/// <param name="probability">Вероятность значения в процентах</param>
			//---------------------------------------------------------------------------------------------------------
			public void AddProbabilityList(params Int32[] probability)
			{
				for (var index = 0; index < probability.Length; index++)
				{
					var count = probability[index] * _capacity / 100;
					for (var i = 0; i < count; i++)
					{
						_probability.Add(index);
					}
				}

				Reset();
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Очистка списка вероятностей
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public void ClearProbability()
			{
				_probability.Clear();
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение следующий вероятности
			/// </summary>
			/// <returns>Следующая вероятность</returns>
			//---------------------------------------------------------------------------------------------------------
			public Int32 NextProbability()
			{
				if (_currentIndex == _capacity - 1)
				{
					_currentIndex = 0;
				}
				else
				{
					_currentIndex++;
				}

				return _data[_currentIndex];
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение следующий вероятности в перезапуск по новому в конце цикла
			/// </summary>
			/// <returns>Следующая вероятность</returns>
			//---------------------------------------------------------------------------------------------------------
			public Int32 NextProbabilityAndReset()
			{
				if (_currentIndex == _capacity - 1)
				{
					Reset();
					_currentIndex = 0;
				}
				else
				{
					_currentIndex++;
				}

				return _data[_currentIndex];
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Проверка на совпадение данной вероятности
			/// </summary>
			/// <param name="index">Индекс вероятности</param>
			/// <returns>Статус вероятность</returns>
			//---------------------------------------------------------------------------------------------------------
			public Boolean CheckProbability(Int32 index)
			{
				if (_currentIndex == _capacity - 1)
				{
					_currentIndex = 0;
				}
				else
				{
					_currentIndex++;
				}

				return _data[_currentIndex] == index;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение данных вероятностей в виде списка строк
			/// </summary>
			/// <returns>Список строк</returns>
			//---------------------------------------------------------------------------------------------------------
			public IList<String> GetDataStrings()
			{
				var lines = new String[_data.Length];

				for (var i = 0; i < _data.Length; i++)
				{
					lines[i] = "i = " + i.ToString() + ", value = " + Data[i].ToString();
				}

				return lines;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================