//=====================================================================================================================
// Проект: Модуль единиц измерения
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUnitMeasurementModule.cs
*		Определение модуля единиц измерения.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace UnitMeasurement
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup UnitMeasurement Модуль единиц измерения
		//! Модуль единиц измерения обеспечивает начальную инфраструктуру для представления базовых типов измерения и
		//! соответствующую им систему единиц измерения.
		//! Основной задачей модуля является представления величины с типом измерения и связанной с ней соответствующей
		//! единицы измерения с возможностью выполнения основных действий(арифметических, логических, преобразования)
		//! которые имеют логический смысл в контексте соответствующего типа и единицы измерения.
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================