//=====================================================================================================================
// Проект: Модуль трехмерного объекта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusObject3DModule.cs
*		Модуль трехмерного объекта обеспечивает универсальное представление трёхмерного объекта, реализует загрузку
*	и экспорт в различные форматы файлов и также представляет различные генераторы для создания параметрических
*	трехмерных объектов.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Object3D
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup Object3D Модуль трехмерного объекта
         * \brief Модуль трехмерного объекта обеспечивает универсальное представление трёхмерного объекта, реализует
			загрузку и экспорт в различные форматы файлов и также представляет различные генераторы для создания
			параметрических трехмерных объектов.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================