#if UNITY_2017_1_OR_NEWER
using System;

namespace Lotus.Core
{
    /**
     * \defgroup CoreUnityResource Подсистема ресурсов Unity
     * \ingroup Core
     * \brief Подсистема ресурсов для загрузки доступных и управления существующими ресурсами. Работу с ресурсами в
        Unity нельзя назвать простой и понятной, особенно это касается ресурсов созданных/подгруженных или добавленных
        уже в готовое приложение. Тем более большинство ресурсов имеет закрытый формат файла.
     * \details
        //## Описание
        Запроектировано, во-первых, создать единый идентификатор для всех стандартных и собственных ресурсов, который будет
        содержать данные необходимые для динамического связывания ресурса, во-вторых, создать систему идентификации ресурса,
        которая будет включать источник создания ресурса, поддерживаемые способы загрузки/сохранения и некоторые другие параметры.

        Также подсистема содержит методы расширения для стандартных ресурсов.
     * @{
     */
    /// <summary>
    /// Источник создания ресурса
    /// </summary>
    /// <remarks>
    /// Источник создания ресурса определяет, каким образом ресурс оказался доступен в приложении, а также возможные
    /// операции, которые могут быть применены к нему
    /// </remarks>
    public enum TResourceCreation
    {
        /// <summary>
        /// Ресурс импортирован непосредственно в сборку.
        /// Поиск и доступ к ресурсу возможен только при его автоматической подгрузки и только по имени
        /// </summary>
        Directly,

        /// <summary>
        /// Ресурс импортирован в сборку, но находится директории "Resources".
        /// Поиск и доступ к ресурсу возможен по имени относительно директории "Resources" сборки.
        /// Возможна самостоятельная динамическая подгрузка через класс Resources
        /// </summary>
        Internal,

        /// <summary>
        /// Ресурс создан во внешней среде или программно в приложении с параметром сохранения.
        /// Обязательно должен быть в папке "ResourcesData" рабочей директории приложения при его загрузки
        /// </summary>
        External,

        /// <summary>
        /// Константный ресурс - ресурс, созданный программно или загруженный из специальных источников который доступен всегда.
        /// Доступ к ресурсу возможен по имени
        /// </summary>
        Const,

        /// <summary>
        /// Временный ресурс доступные только во время работы приложения.
        /// Динамическое связывание, сохранение идентификатора для таких ресурсов не целесообразно
        /// </summary>
        Temp
    }


    /// <summary>
    /// Поддерживаемые режимы загрузки ресурса из внешних источников
    /// </summary>
    public enum TResourceSupportLoad
    {
        /// <summary>
        /// Ресурс нельзя загрузить напрямую из внешних источников
        /// </summary>
        None,

        /// <summary>
        /// Ресурс поддерживает только обычную загрузку
        /// </summary>
        Sync,

        /// <summary>
        /// Ресурс поддерживает только асинхронную загрузку
        /// </summary>
        [Obsolete("WWW удалён. Используйте UnityWebRequest / SyncAndAsync с новым провайдером")]
        Async,

        /// <summary>
        /// Ресурс поддерживает обычную загрузку и асинхронную загрузку
        /// </summary>
        SyncAndAsync
    }


    /// <summary>
    /// Режим загрузки ресурса
    /// </summary>
    public enum TResourceLoad
    {
        /// <summary>
        /// Обычная загрузка ресурса.
        /// Используются в основном для своих типов, для основных ресурсов требуется как правило писать собственные загрузчики
        /// </summary>
        Sync,

        /// <summary>
        /// Асинхронная загрузка
        /// </summary>
        [Obsolete("WWW удалён. Используйте UnityWebRequest")]
        Async
    }


    /// <summary>
    /// Универсальный идентификатор ресурсов Unity которые возможно загрузить во время работы приложения
    /// </summary>
    /// <remarks>
    /// Данный идентификатор содержит все сведения для идентификации и динамического связывания любого доступного ресурса в Unity.
    /// Если компонент/игровой объект ссылается на ресурс, то ему будет достаточно сохранить идентификатор этого ресурса.
    /// В дальнейшем, путем использования диспетчера соответствующего ресурса возможна загрузка и повторное
    /// динамическое связывания любого доступного ресурса в Unity
    /// </remarks>
    [Serializable]
    public class CResourceId : IComparable<CResourceId>
    {
        #region Constants
        /// <summary>
        /// Имя элемента узла XML представляющего данный тип
        /// </summary>
        public const string XmlNameElement = "ResourceId";
        #endregion

        #region Fields
        internal string _name;
        internal string _path;
        internal int _index;
        internal int _id;
        internal TResourceCreation _creation;
        #endregion

        #region Properties
        /// <summary>
        /// Имя ресурса
        /// </summary>
        public string Name
        {
            get { return _name; }
        }

        /// <summary>
        /// Путь к ресурсу
        /// </summary>
        public string Path
        {
            get { return _path; }
        }

        /// <summary>
        /// Имя источника ресурса, то по-которому данный ресурс можно корректно загрузить/восстановить.
        /// Может быть:
        /// - совпадать с именем ресурса, если он используется непосредственно внутри сборки или константный
        /// - путь относительно директории "Resources" сборки.
        /// - полный путь в формате URL, если требуется загрузить асинхронно.
        /// - относительный/абсолютный путь файла, если требуется загрузить обычно.
        /// </summary>
        public string SourceName
        {
            get { return _path; }
        }

        /// <summary>
        /// Индекс ресурса. Обычное значение ноль.
        /// Но при пакетной загрузки ресурсов обозначает номер/позицию ресурса в массиве ресурсов
        /// </summary>
        public int Index
        {
            get { return _index; }
        }

        /// <summary>
        /// Идентификатор ресурса
        /// Предназначен для более быстрого поиска ресурса
        /// </summary>
        public int ID
        {
            get { return _id; }
        }

        /// <summary>
        /// Источник создания ресурса
        /// </summary>
        public TResourceCreation Creation
        {
            get { return _creation; }
        }
        #endregion

        #region Constructors
        /// <summary>
        /// Конструктор инициализирует данные идентификатора ресурса значениями по умолчанию
        /// </summary>
        public CResourceId()
        {
            _name = string.Empty;
            _path = string.Empty;
            _index = 0;
            _id = -1;
            _creation = TResourceCreation.Internal;
        }
        #endregion

        #region System methods
        /// <summary>
        /// Сравнение идентификаторов ресурсов для упорядочивания
        /// </summary>
        /// <param name="other">Идентификатор ресурса</param>
        /// <returns>Статус сравнения идентификаторов ресурсов</returns>
        public int CompareTo(CResourceId other)
        {
            if (_id > other._id)
            {
                return 1;
            }
            else
            {
                if (_id == other._id)
                {
                    return string.CompareOrdinal(_path, other._path);
                }
                else
                {
                    return -1;
                }
            }
        }

        /// <summary>
        /// Преобразование к текстовому представлению
        /// </summary>
        /// <returns>Текстовое представление идентификатора ресурса с указанием источника ресурса</returns>
        public override string ToString()
        {
            return SourceName;
        }
        #endregion
    }

    /**@}*/
}
#endif
