//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема сообщений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusMessageHandler.cs
*		Определение основного интерфейса для подписки на события.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreMessage
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения типовых кодов обработки сообщения 
		/// </summary>
		/// <remarks>
		/// Сообщение может быть обработано с возвратом любого результата за исключением системных
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public static class XMessageHandlerResultCode
		{
			/// <summary>
			/// Сообщение выполнено с отрицательным результатом
			/// </summary>
			public const Int32 NEGATIVERESULT = -1;

			/// <summary>
			/// Сообщение не обработано
			/// </summary>
			public const Int32 NOTPROCESSED = 0;

			/// <summary>
			/// Сообщение обработано
			/// </summary>
			public const Int32 PROCESSED = 1;
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения возможности обработки сообщения
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusMessageHandler
		{
			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Основной метод для обработки сообщения
			/// </summary>
			/// <param name="args">Аргументы сообщения</param>
			/// <returns>Результат обработки сообщения</returns>
			//---------------------------------------------------------------------------------------------------------
			Int32 OnMessageHandler(CMessageArgs args);
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================