//=====================================================================================================================
// Проект: Модуль репозитория
// Раздел: Подсистема фильтрации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositoryFilterFunction.cs
*		Определение основных функций для фильтрации данных.
*		Функции фильтров предназначены для поиска определённых данных удовлетворяющих условию фильтра.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup RepositoryFilter Подсистема фильтрации
         * \ingroup Repository
         * \brief Подсистема фильтрации определяет однотипный унифицированный набор типов для фильтрации данных.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Функции для фильтрации данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TFilterFunction
		{
			/// <summary>
			/// Равно аргументу
			/// </summary>
			Equals,

			/// <summary>
			/// Не равно аргументу
			/// </summary>
			NotEqual,

			/// <summary>
			/// Меньше аргумента
			/// </summary>
			LessThan,

			/// <summary>
			/// Меньше или равно аргумента
			/// </summary>
			LessThanOrEqual,

			/// <summary>
			/// Больше аргумента
			/// </summary>
			GreaterThan,

			/// <summary>
			/// Больше или равно аргумента
			/// </summary>
			GreaterThanOrEqual,

			/// <summary>
			/// Между первым аргументом (меньшим) и вторым аргументом (большим)
			/// </summary>
			Between,

			/// <summary>
			/// Aргумент(строка) может находиться в любом месте без учета регистра
			/// </summary>
			Contains,

			/// <summary>
			/// Aргумент(строка) должна находится в начала без учета регистра
			/// </summary>
			StartsWith,

			/// <summary>
			/// Aргумент(строка) должна находится в конце без учета регистра
			/// </summary>
			EndsWith,

			/// <summary>
			/// Не равно пустой строке. Аргумент пустая строка
			/// </summary>
			NotEmpty,

			/// <summary>
			/// Любой из элементов аргумента может находиться в массиве
			/// </summary>
			IncludeAny,

			/// <summary>
			/// Все элементы аргумента должны находятся в массиве
			/// </summary>
			IncludeAll,

			/// <summary>
			/// Ни один из элементов аргумента не должен находится в массиве
			/// </summary>
			IncludeNone,
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================