//=====================================================================================================================
// Проект: Модуль репозитория
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositoryModule.cs
*		Модуль репозитория определяет базовый интерфейс репозитория данных который содержит набор типовых методов 
	для работы с коллекциями сущностей. Также модуль реализует репозиторий для базы данных, для отдельного файла и 
	для отдельного страничного хранения данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup Repository Модуль репозитория
         * \brief Модуль репозитория определяет базовый интерфейс репозитория данных который содержит набор типовых
			методов для работы с коллекциями сущностей. Также модуль реализует репозиторий для базы данных, 
			для отдельного файла и для отдельного страничного хранения данных.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================