//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема задач
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusTaskCommon.cs
*		Общие типы и структуры данных подсистемы задач.
*		Общие типы и структуры данных подсистемы задач и определение основного интерфейса для представления задачи.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup CoreTask Подсистема задач
         * \ingroup Core
         * \brief Подсистема задач (не потоки) предназначена для формирования задачи или группы задачи которая может выполняться
			последовательно или параллельно, с определенным режимом выполнения, а также с возможностью приостановки и 
			дальнейшего выполнения.
		 * \details
			## Возможности/особенности
			1. Выполнение задачи по критериям интерфейса \ref Lotus.Core.ILotusTask.
			2. Поддержка задержки начала выполнения, паузы, информирования о ходе выполнения задачи.
			3. Работа с группами задач, возможность запускать последовательно и параллельно исполнения в группе.
			4. Задержка при выполнение задач группы, информирования об окончании выполнения каждой задачи.
			
			## Описание
			Соответствующая задача формируется классом на основе реализации интерфейса.
			Под задачей понимается элементарная единица выполнения с правильно реализованным интерфейсов, выполняемая
			определённым способом с возможностью информирования об окончании задачи, паузой и принудительной остановкой
			выполнения задачи.

			Под группой задач понимается несколько задач выполняемых параллельно или последовательно определённым
			способом(в том числе с задержкой) с возможностью информирования об окончании выполнения всех задач группы,
			паузой и принудительной остановкой выполнения группы задачи.

			## Использование
			1. Правильно реализовать интерфейс \ref Lotus.Core.ILotusTask.
			2. Сформировать задачу или группу задач и запустить на исполнение методами \ref Lotus.Core.CTaskExecutor или \ref Lotus.Core.CTaskGroupExecutor
			3. Методы исполнителя задач нужно использовать в ручную(непосредственно вызывать его методы в нужных местах)
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Способ выполнения задачи
		/// </summary>
		/// <remarks>
		/// Способ выполнения задачи определяет временные параметры выполнения задачи
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TTaskMethod
		{
			/// <summary>
			/// Задача выполняется каждый кадр в методе Update
			/// </summary>
			EachFrame,

			/// <summary>
			/// Задача выполняется каждый определенный кадр в методе Update. Например каждый десятый
			/// </summary>
			/// <remarks>
			/// Применяется для задач не критичных к производительности
			/// </remarks>
			EveryFrame
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Режим выполнения группы задач
		/// </summary>
		/// <remarks>
		/// Применяется когда группа задач сформирована из нескольких задач
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TTaskExecuteMode
		{
			/// <summary>
			/// Параллельное выполнении всех задач группы
			/// </summary>
			Parallel,

			/// <summary>
			/// Последовательно выполнении всех задач группы
			/// </summary>
			Sequentially
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения задачи
		/// </summary>
		/// <remarks>
		/// Под задачей понимается элементарная единица выполнения с правильно реализованным интерфейсов, выполняемая
		/// определённым способом с возможностью информирования об окончании задачи и принудительной остановкой
		/// выполнения задачи
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusTask
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Статус завершение задачи
			/// </summary>
			/// <remarks>
			/// Свойство обязательное для реализации.
			/// Реализация должна предусматривать максимальную эффективность получения данных
			/// </remarks>
			Boolean IsTaskCompleted { get; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Запуск выполнение задачи
			/// </summary>
			/// <remarks>
			/// Здесь должна выполняться первоначальная работа по подготовки к выполнению задачи.
			/// После запуска этого метода задача будет запущена
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			void RunTask();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Выполнение задачи
			/// </summary>
			/// <remarks>
			/// Непосредственное выполнение задачи.
			/// Метод будет вызываться каждый раз в зависимости от способа и режима выполнения задачи
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			void ExecuteTask();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Принудительная остановка выполнения задачи
			/// </summary>
			/// <remarks>
			/// Если задачи будет принудительно остановлена то здесь можно/нужно реализовать необходимые действия
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			void StopTask();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Переустановка данных задачи
			/// </summary>
			/// <remarks>
			/// Здесь может быть выполняться работа по подготовки к выполнению задачи, но без запуска на выполнение
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			void ResetTask();
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения задачи с возможность информирования о ходе ее выполнения
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusTaskInfo : ILotusTask
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Процент выполнения задачи
			/// </summary>
			Single TaskPercentCompletion { get; }
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс-оболочка для хранения определенной задачи
		/// </summary>
		/// <remarks>
		/// Для реализации максимальной гибкости имеются ряд дополнительных параметров обеспечивающих нужное выполнение задачи
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public class CTaskHolder : ILotusPoolObject, ILotusTask
		{
			#region ======================================= ДАННЫЕ ====================================================
			// Основные параметры
			protected internal ILotusTask mTask;
			protected internal Int32 mId;
			protected internal String mName;
			protected internal Boolean mIsCompleted;
			protected internal Boolean mIsRunning;
			protected internal Boolean mIsPause;
			protected internal Boolean mIsDelayStart;
			protected internal Single mDelayStart;
			protected internal Single mStartTaskTime;
			protected internal TTaskMethod mMethodMode;
			protected internal Int32 mMethodFrame;
			protected internal Boolean mIsPoolObject;

			// События
			protected internal Action mOnTaskStarted;
			protected internal Action mOnTaskCompleted;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			//
			// ОСНОВНЫЕ ПАРАМЕТРЫ
			//
			/// <summary>
			/// Задача
			/// </summary>
			public ILotusTask Task
			{
				get { return mTask; }
				set { mTask = value; }
			}

			/// <summary>
			/// Идентификатор задачи
			/// </summary>
			public Int32 Id
			{
				get { return mId; }
				set { mId = value; }
			}

			/// <summary>
			/// Имя задачи
			/// </summary>
			public String Name
			{
				get { return mName; }
				set { mName = value; }
			}

			/// <summary>
			/// Статус завершения выполнения задачи
			/// </summary>
			public Boolean IsCompleted
			{
				get { return mIsCompleted; }
			}

			/// <summary>
			/// Статус выполнения задачи
			/// </summary>
			/// <remarks>
			/// Означает что в данный момент задачи имеет статус выполнения.
			/// Непосредственное исполнение зависит еще от статуса паузы
			/// </remarks>
			public Boolean IsRunning
			{
				get { return mIsRunning; }
			}

			/// <summary>
			/// Пауза выполнения задач
			/// </summary>
			public Boolean IsPause
			{
				get { return mIsPause; }
				set { mIsPause = value; }
			}

			/// <summary>
			/// Задержка в секундах перед запуском задачи
			/// </summary>
			/// <remarks>
			/// Иногда нужно запустить задачу не сразу, а например спустя какое либо время, например после визуального эффекта
			/// </remarks>
			public Single DelayStart
			{
				get { return mDelayStart; }
				set { mDelayStart = value; }
			}

			/// <summary>
			/// Способ выполнения задачи
			/// </summary>
			public TTaskMethod MethodMode
			{
				get { return mMethodMode; }
				set { mMethodMode = value; }
			}

			/// <summary>
			/// Каждый какой кадр будет выполняться задача
			/// </summary>
			/// <remarks>
			/// Применяется если установлен способ выполнения задачи <see cref="TTaskMethod.EveryFrame"/>
			/// </remarks>
			public Int32 MethodFrame
			{
				get { return mMethodFrame; }
				set { mMethodFrame = value; }
			}

			/// <summary>
			/// Статус объекта из пула
			/// </summary>
			/// <remarks>
			/// В целях оптимизации некоторые оболочки задачи будут в пуле
			/// </remarks>
			public Boolean IsPoolObject
			{
				get { return mIsPoolObject; }
				set { mIsPoolObject = value; }
			}

			//
			// СОБЫТИЯ
			//
			/// <summary>
			/// Событие для нотификации о начале выполнения задачи
			/// </summary>
			public Action OnTaskStarted
			{
				get { return mOnTaskStarted; }
				set { mOnTaskStarted = value; }
			}

			/// <summary>
			/// Событие для нотификации об окончании выполнения задачи
			/// </summary>
			public Action OnTaskCompleted
			{
				get { return mOnTaskCompleted; }
				set { mOnTaskCompleted = value; }
			}
			#endregion

			#region ======================================= СВОЙСТВА ILotusTask =======================================
			/// <summary>
			/// Статус завершение задачи
			/// </summary>
			/// <remarks>
			/// Свойство обязательное для реализации
			/// </remarks>
			public Boolean IsTaskCompleted
			{
				get
				{
					return mIsCompleted;
				}
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CTaskHolder()
			{
				mId = -1;
				mMethodFrame = 10;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="isPoolObject">Статус объекта созданного в пуле</param>
			//---------------------------------------------------------------------------------------------------------
			public CTaskHolder(Boolean isPoolObject)
			{
				mId = -1;
				mMethodFrame = 10;
				mIsPoolObject = isPoolObject;
			}
			#endregion

			#region ======================================= МЕТОДЫ ILotusPoolObject ===================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Псевдо-конструктор
			/// </summary>
			/// <remarks>
			/// Вызывается диспетчером пула в момент взятия объекта из пула
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			public void OnPoolTake()
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Псевдо-деструктор
			/// </summary>
			/// <remarks>
			/// Вызывается диспетчером пула в момент попадания объекта в пул
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			public void OnPoolRelease()
			{
				mId = -1;
				mTask = null;
				mDelayStart = 0.0f;
				mOnTaskStarted = null;
				mOnTaskCompleted = null;
			}
			#endregion

			#region ======================================= МЕТОДЫ ILotusTask =========================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Запуск выполнение задачи
			/// </summary>
			/// <remarks>
			/// Здесь должна выполняться первоначальная работа по подготовки к выполнению задачи
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			public void RunTask()
			{
				mIsRunning = true;
				mIsPause = false;
				mIsCompleted = false;
				mIsDelayStart = mDelayStart > 0;
				mStartTaskTime = 0;

				if (mIsDelayStart == false)
				{
					mTask.RunTask();
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Выполнение задачи
			/// </summary>
			/// <remarks>
			/// Непосредственное выполнение задачи.
			/// Метод будет вызываться каждый раз в зависимости от способа и режима выполнения задачи
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			public void ExecuteTask()
			{
				if (mIsDelayStart)
				{
#if UNITY_2017_1_OR_NEWER
					mStartTaskTime += UnityEngine.Time.deltaTime;
#endif
					if (mStartTaskTime > mDelayStart)
					{
						mTask.RunTask();
						mIsDelayStart = false;
					}
				}
				else
				{
					if (mMethodMode == TTaskMethod.EachFrame)
					{
						mTask.ExecuteTask();
						mIsCompleted = mTask.IsTaskCompleted;
					}
					else
					{
#if UNITY_2017_1_OR_NEWER

						if (UnityEngine.Time.frameCount % mMethodFrame == 0)
						{
							mTask.ExecuteTask();
							mIsCompleted = mTask.IsTaskCompleted;
						}
#else
#endif
					}
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Принудительная остановка выполнения задачи
			/// </summary>
			/// <remarks>
			/// Если задачи будет принудительно остановлена то здесь можно/нужно реализовать необходимые действия
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			public void StopTask()
			{
				mIsRunning = false;
				mIsPause = false;
				mIsCompleted = false;
				mStartTaskTime = 0;
				mTask.StopTask();
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Переустановка данных задачи
			/// </summary>
			/// <remarks>
			/// Здесь может быть выполняться работа по подготовки к выполнению задачи, но без запуска на выполнение
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			public void ResetTask()
			{
				mIsRunning = false;
				mIsPause = false;
				mStartTaskTime = 0;
				mIsCompleted = false;
				mTask.ResetTask();
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================