//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема атрибутов
// Подраздел: Атрибуты связанные с возможностью непосредственно управлять значением поля/свойства объекта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusAttributeValueDefault.cs
*		Атрибут для определения свойства/поля у которого есть значение по умолчанию.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup CoreAttribute
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Атрибут для определения свойства/поля у которого есть значение по умолчанию
        /// </summary>
        /// <remarks>
        /// В зависимости от способа задания, значение распространяется либо на весь тип, либо к каждому экземпляру
        /// </remarks>
        //-------------------------------------------------------------------------------------------------------------
        [AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
#if UNITY_2017_1_OR_NEWER
		public sealed class LotusDefaultValueAttribute : UnityEngine.PropertyAttribute
#else
		public sealed class LotusDefaultValueAttribute : Attribute
#endif
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal readonly System.Object _defaultValue;
			internal readonly String _memberName;
			internal readonly TInspectorMemberType _memberType;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Значение по умолчанию
			/// </summary>
			public System.Object DefaultValue
			{
				get { return _defaultValue; }
			}

			/// <summary>
			/// Имя члена объекта содержащие значение по умолчанию
			/// </summary>
			public String MemberName
			{
				get { return _memberName; }
			}

			/// <summary>
			/// Тип члена объекта
			/// </summary>
			public TInspectorMemberType MemberType
			{
				get { return _memberType; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="defaultValue">Значение по умолчанию</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusDefaultValueAttribute(System.Object defaultValue)
			{
				_defaultValue = defaultValue;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="memberName">Имя члена объекта содержащий значение по умолчанию</param>
			/// <param name="memberType">Тип члена объекта</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusDefaultValueAttribute(String memberName, TInspectorMemberType memberType)
			{
				_memberName = memberName;
				_memberType = memberType;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="type">Тип представляющий шаг содержащий значение по умолчанию</param>
			/// <param name="memberName">Имя члена типа содержащий значение по умолчанию</param>
			/// <param name="memberType">Тип члена типа</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusDefaultValueAttribute(Type type, String memberName, TInspectorMemberType memberType)
			{
				_defaultValue = type;
				_memberName = memberName;
				_memberType = memberType;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================