//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема функций плавности
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusEasingCommon.cs
*		Определение функций плавности изменения скорости для создания более реалистичных анимации.
*		Реальные вещи не начинают двигаться мгновенно и с постоянной скоростью. Если мы открываем ящик стола, то сначала
*	ускоряем его, а на второй половине пути — тормозим. Если что-то упало, то оно сначала летит все быстрее и быстрее, 
*	а ударившись о пол — слегка подпрыгивает обратно. В каждом конкретном случаем нужно подбирать свою функцию плавности.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup CoreEasing Подсистема функций плавности
         * \ingroup Core
         * \brief Определение функций плавности изменения скорости для создания более реалистичных анимации. 
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Основные типы функции плавности
		/// </summary>
		/// <remarks>
		/// Под функцией понимается математическая закономерность изменения скорости от времени
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TEasingType
		{
			/// <summary>
			/// Линейная функция
			/// </summary>
			Linear,

			/// <summary>
			/// Квадратическая зависимость в начале
			/// </summary>
			QuadIn,

			/// <summary>
			/// Квадратическая зависимость в конце
			/// </summary>
			QuadOut,

			/// <summary>
			/// Квадратическая зависимость в начале и в конце
			/// </summary>
			QuadInOut,

			/// <summary>
			/// Кубическая зависимость в начале
			/// </summary>
			CubeIn,

			/// <summary>
			/// Кубическая зависимость в конце
			/// </summary>
			CubeOut,

			/// <summary>
			/// Кубическая зависимость в начале и в конце
			/// </summary>
			CubeInOut,

			/// <summary>
			/// Кратковременное изменение на противоположенное в начале
			/// </summary>
			BackIn,

			/// <summary>
			/// Кратковременное изменение на противоположенное в конце
			/// </summary>
			BackOut,

			/// <summary>
			/// Кратковременное изменение на противоположенное в начале и в конце
			/// </summary>
			BackInOut,

			/// <summary>
			/// Экспоненциальная зависимость в начале
			/// </summary>
			ExpoIn,

			/// <summary>
			/// Экспоненциальная зависимость в конце
			/// </summary>
			ExpoOut,

			/// <summary>
			/// Экспоненциальная зависимость в начале и в конце
			/// </summary>
			ExpoInOut,

			/// <summary>
			/// Синусоидальная зависимость в начале
			/// </summary>
			SineIn,

			/// <summary>
			/// Синусоидальная зависимость в конце
			/// </summary>
			SineOut,

			/// <summary>
			/// Синусоидальная зависимость в начале и в конце
			/// </summary>
			SineInOut,

			/// <summary>
			/// Колебательная форма в начале
			/// </summary>
			ElasticIn,

			/// <summary>
			/// Колебательная форма в конце
			/// </summary>
			ElasticOut,

			/// <summary>
			/// Колебательная форма в начале и в конце
			/// </summary>
			ElasticInOut,

			/// <summary>
			/// Форма отскока в начале
			/// </summary>
			BounceIn,

			/// <summary>
			/// Форма отскока в конце
			/// </summary>
			BounceOut,

			/// <summary>
			/// Форма отскока в начале и в конце
			/// </summary>
			BounceInOut
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================