//=====================================================================================================================
// Проект: Модуль единиц измерения
// Раздел: Типы измерения
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUnitMeasurementType.cs
*		Определение основных типов измерения.
*		Тип измерения определяет для какой конкретно физической величины или математической абстракции происходит измерения. 
*	В зависимости от типа измерения определяется доступный набор единиц измерения.
*		Типы измерения бывают базовые, производные и комплексные.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace UnitMeasurement
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup UnitMeasurement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение доступных типов измерения
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TMeasurementType
		{
			/// <summary>
			/// Не определена
			/// </summary>
			Undefined = 0,

			/// <summary>
			/// Единица измерения вещей/предметов/абстаркций <see cref="TUnitThing"/>
			/// </summary>
			Thing,

			/// <summary>
			/// Единица измерения длины <see cref="TUnitLength"/>
			/// </summary>
			Length,

			/// <summary>
			/// Единица измерения площади <see cref="TUnitArea"/>
			/// </summary>
			Area,

			/// <summary>
			/// Единица измерения объема <see cref="TUnitVolume"/>
			/// </summary>
			Volume,

			/// <summary>
			/// Единица измерения массы <see cref="TUnitMass"/>
			/// </summary>
			Mass,

			/// <summary>
			/// Единица измерения времени <see cref="TUnitTime"/>
			/// </summary>
			Time,

			/// <summary>
			/// Единица измерения трудоемкости <see cref="TUnitLaborintensity"/>
			/// </summary>
			Laborintensity,

			/// <summary>
			/// Единица измерения машиноемкости <see cref="TUnitMachinecapacity"/>
			/// </summary>
			Machinecapacity
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================