//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема отображения данных формата JSON
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusViewItemJson.cs
*		Определение элемента отображения данных формата JSON.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Collections;
using System.Collections.Specialized;
using System.ComponentModel;
//---------------------------------------------------------------------------------------------------------------------
using Newtonsoft.Json;
using Newtonsoft.Json.Linq;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup CoreViewItem
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс реализующий минимальный элемент отображения данных формата JSON
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CViewItemJson : ViewItemHierarchy<JObject>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemJson()
				: this(String.Empty)
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя модели</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemJson(String name)
				: base(name)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="dataContext">Данные</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemJson(JObject dataContext)
				: base(dataContext)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="dataContext">Данные</param>
			/// <param name="parent_item">Родительский узел</param>
			//---------------------------------------------------------------------------------------------------------
			public CViewItemJson(JObject dataContext, ILotusViewItemHierarchy parent_item)
				: base(dataContext, parent_item)
			{
			}
			#endregion

			#region ======================================= МЕТОДЫ ILotusViewItem =====================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Создание экземпляра элемента отображения
			/// </summary>
			/// <returns>Элемент отображения</returns>
			//---------------------------------------------------------------------------------------------------------
			public override ILotusViewItem CreateViewItem()
			{
				return (new CViewItemJson());
			}
			#endregion

			#region ======================================= МЕТОДЫ ILotusViewItemHierarchy ============================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Создание экземпляра иерархического элемента отображения
			/// </summary>
			/// <returns>Элемент отображения</returns>
			//---------------------------------------------------------------------------------------------------------
			public override ILotusViewItemHierarchy CreateViewItemHierarchy()
			{
				return (new CViewItemJson());
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Построение дочерней иерархии согласно источнику данных
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public override void BuildFromDataContext()
			{
				//CCollectionViewJson.BuildFromParent(mOwner, this);
			}
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для элементов отображения которые поддерживают концепцию просмотра и управления с полноценной 
		/// поддержкой всех операций
		/// </summary>
		/// <remarks>
		/// Данная коллекции позволяет управлять видимостью данных, обеспечивает их сортировку, группировку, фильтрацию, 
		/// позволяет выбирать данные и производить над ними операции
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public class CCollectionViewJson : CollectionViewHierarchy<CViewItemJson, JObject>
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public CCollectionViewJson()
				: base(String.Empty)
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя коллекции</param>
			//---------------------------------------------------------------------------------------------------------
			public CCollectionViewJson(String name)
				: base(name)
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Имя коллекции</param>
			/// <param name="source">Источник данных</param>
			//---------------------------------------------------------------------------------------------------------
			public CCollectionViewJson(String name, JObject source)
				: base(name, source)
			{
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================