//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема идентификаторов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusIdentifierBase.cs
*		Определение базовых интерфейсов для идентификации объектов.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup CoreIdentifiers Подсистема идентификаторов
         * \ingroup Core
         * \brief Подсистема идентификаторов определяет базовые понятия об идентификации и классы идентификации объектов.
         * \details Под идентификацией объекта понимается наличие у сущности определённого уникального идентификатора по 
			которому ее возможно однозначно найти или получить в определённом контексте.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Базовый интерфейс обозначающих что сущность поддерживает идентификацию
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusIdentifier
		{
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение шаблона интерфейса для идентификации сущности через уникальный идентификатор-ключ
		/// </summary>
		/// <typeparam name="TKey">Тип ключа</typeparam>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusIdentifierIdTemplate<TKey> : ILotusIdentifier where TKey : IEquatable<TKey>
		{
			/// <summary>
			/// Ключ сущности
			/// </summary>
			TKey Id { get; set; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для объектов реализующих идентификации через глобальный идентификатор
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusIdentifierGlobal : ILotusIdentifierIdTemplate<Guid>
		{
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для объектов реализующих идентификации через уникальный числовой идентификатор
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusIdentifierInt : ILotusIdentifierIdTemplate<Int32>
		{
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для объектов реализующих идентификации через уникальный числовой идентификатор
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusIdentifierLong : ILotusIdentifierIdTemplate<Int64>
		{
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для объектов реализующих понятие имени
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusNameable
		{
			/// <summary>
			/// Имя объекта
			/// </summary>
			String Name { get; set; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================