//=====================================================================================================================
// Проект: Модуль репозитория
// Раздел: Подсистема файловых ресурсов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositoryFileCreateRequest.cs
*		Классы для создания новый файлов.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.IO;
//=====================================================================================================================
namespace Lotus
{
    namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup RepositoryResourceFile
        *@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания нового файла
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public abstract class FileCreateRequest
		{
			/// <summary>
			/// Наименование файла
			/// </summary>
			public String? Name { get; set; }

			/// <summary>
			/// Место назначение файла
			/// </summary>
			public TResourceFileStorage Target { get; set; }

			/// <summary>
			/// Формат хранения файла
			/// </summary>
			public TResourceFileSaveFormat SaveFormat { get; set; }

			/// <summary>
			/// Идентификатор автора файла
			/// </summary>
			public Guid? AuthorId { get; set; }

			/// <summary>
			/// Идентификатор типа файла
			/// </summary>
			public Int32? FileTypeId { get; set; }

			/// <summary>
			/// Идентификатор группы файла
			/// </summary>
			public Int32? GroupId { get; set; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания ссылки на локальный файл
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class FileCreateLocalRequest : FileCreateRequest
		{
			/// <summary>
			/// Идентификатор файла
			/// </summary>
			public Guid Id { get; set; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания нового файла из потока
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class FileCreateStreamRequest : FileCreateRequest
		{
			/// <summary>
			/// Поток для чтения файла
			/// </summary>
			public Stream ReadStream { get; set; } = default!;

			public FileCreateStreamRequest()
			{
				SaveFormat = TResourceFileSaveFormat.Raw;
				Target = TResourceFileStorage.Database;
			}
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания нового файла из байтового массива
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class FileCreateRawRequest : FileCreateRequest
		{
			/// <summary>
			/// Данные файла
			/// </summary>
			public Byte[] Data { get; set; } = default!;

			public FileCreateRawRequest()
			{
				SaveFormat = TResourceFileSaveFormat.Raw;
				Target = TResourceFileStorage.Database;
			}
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания нового файла из строки base64
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class FileCreateBase64Request : FileCreateRequest
		{
			/// <summary>
			/// Данные файла в формате строки base64
			/// </summary>
			public String Data { get; set; } = default!;

			public FileCreateBase64Request()
			{
				SaveFormat = TResourceFileSaveFormat.Base64;
				Target = TResourceFileStorage.Database;
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================