//=====================================================================================================================
// Проект: Модуль репозитория
// Раздел: Подсистема файловых ресурсов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRepositoryFileDto.cs
*		Класс для представления данных файла.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace Repository
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup RepositoryResourceFile
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для представления данных файла
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class FileDto : IdentifierDtoId<Guid>
		{
			/// <summary>
			/// Наименование файла
			/// </summary>
			[MaxLength(20)]
			public String? Name { get; set; }

			/// <summary>
			/// Размер изображения в байтах
			/// </summary>
			public Int32? SizeInBytes { get; set; }
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для представления данных файла в формате строки base64
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class FileBase64Dto : FileDto
		{
			/// <summary>
			/// Данные файла в формате строки base64
			/// </summary>
			public String Data { get; set; } = default!;
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для представления данных файла в формате байтового массива
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class FileRawDto : FileDto
		{
			/// <summary>
			/// Данные файла
			/// </summary>
			public Byte[] Data { get; set; } = default!;
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================

