//=====================================================================================================================
// Проект: Модуль базового ядра
// Раздел: Подсистема атрибутов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusAttributesBase.cs
*		Определение базовой концепции атрибута характеристики/модификации отображаемого члена объекта инспектором свойств.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		/** 
         * \defgroup CoreAttribute Подсистема атрибутов
         * \ingroup Core
         * \brief Подсистема атрибутов содержит необходимые атрибуты для расширения функциональности и добавления новых
			характеристик к свойствам, методам и классам.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Тип члена объекта для атрибутов поддержки инспектора свойств
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TInspectorMemberType
		{
			/// <summary>
			/// Поле
			/// </summary>
			Field,

			/// <summary>
			/// Свойство
			/// </summary>
			Property,

			/// <summary>
			/// Метод
			/// </summary>
			Method
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================